// 霸都丶傲天 2019年10月10日 https://github.com/AJLoveChina/birthday
var config = {
    // 句子的长度可以任意， 你可以写十句话， 二十句话都可以
    // 每句话尽量不要超过15个字,不然展示效果可能不太好
    texts: [
        "送给我",      //这里,每句话结尾的最后一个逗号必须是英文的哦!! 很重要哦!!
        "最爱的倩倩",  // 同上...
        "这是和你过的第8个生日",
        "从学生时代开始",
        "我们跨过那些河",
        "走过那些路",
        "看过美丽的风景",
        "吃遍了天下美食",
        "我们订婚",
        "结婚",
        "买房",
        "有了世上最美的2个小天使",
        "我们会一直幸福地",
        "走向一个又一个美好的明天",
    ],
    /**
     * imgs 可以不填, 但是如果要填写的话必须遵循下面的格式
     * "对应上面的文字, 要完全一样" : "图片地址, 可以把图片放在imgs文件夹中"
     * 例如
     * "心爱的小可爱": "./imgs/xiaokeai.jpg"
     *
     * 如果不要图片的话, 直接在每行开头写两个斜杠注释即可, 例如下面的 "今天是你的生日" 的图片就不会展示了:)
     * Tip: 图片最好用正方形or接近正方形, 看起来效果更好
     */
    imgs: {
        "最爱的倩倩": "./imgs/1737945632319.jpg",
        "这是和你过的第8个生日": "./imgs/IMG_20240127_200936.jpg",
        "从学生时代开始": "./imgs/1737945945351.jpg",
        "我们跨过那些河": "./imgs/1737945512120.jpg",
        "走过那些路": "./imgs/1737952792858.jpg",
        "看过美丽的风景": "./imgs/1737945753051.jpg",
        "吃遍了天下美食": "./imgs/1737952963341.jpg",
        "我们订婚": "./imgs/1737952926716.jpg",
        "结婚": "./imgs/1737952843204.jpg",
        "买房": "./imgs/IMG_20240115_131655.jpg",
        "有了世上最美的2个小天使": "./imgs/mmexport1717943609304.jpg",
        "我们会一直幸福地": "./imgs/IMG_20241218_201535.jpg",
        "走向一个又一个美好的明天": "./imgs/IMG_20231003_174116.jpg",

        // "今天是你的生日": "./imgs/birthday.jpg",
    },
    // 按钮文字描述, 以下是默认的按钮文字，英文的，您可以改成你喜欢的文字
    desc: {
        turn_on: "开始",
        play: "音乐",
        bannar_coming: "横幅",
        balloons_flying: "好像少点东西",
        cake_fadein: "蛋糕？",
        light_candle: "蜡烛？",
        wish_message: "生日快乐！",
        story: "A MESSAGE FOR YOU",
    }
};
